Repository: ystk/debian-postfix
Catalog: debian/po/*.po
Languages: eu

source: Add a 'mydomain' entry in main.cf for upgrade?
eu: Bertsio berritzerako main.cf-en 'mydomain' sarrera bat gehitu

source: Postfix version 2.3.3-2 and later require changes in main.cf. Specifically, mydomain must be specified, since hostname(1) is not a fully qualified domain name (FQDN).
eu: Postfix 2.3.3-2 bertsio eta berriagoek main.cf fitxategian aldaketa batzuk egitea behar dute. Zehazki, mydomain ezarri egin behar da, hostname(1) ez bada guztiz kualifikaturiko domeinu izen (FQDN) bat.

source: Failure to fix this will result in a broken mailer. Decline this option to abort the upgrade, giving you the opportunity to add this configuration yourself. Accept this option to automatically set mydomain based on the FQDN of the machine.
eu: Hau konpontzean huts egiteak posta sistema apurtzea eragin dezake. Aukera hau alde batetara utzi bertsio berritzea utzi eta konfigurazio aldaketak eskuz egiteko aukera izateko. Aukera honen ezarpen automatikoa onartu mydomain makinaren FQDN-ra ezartzeko.

source: Install postfix despite an unsupported kernel?
eu: Postfix instalatu nahiz onartugabeko kernela izan?

source: Postfix uses features that are not found in kernels prior to 2.6. If you proceed with the installation, Postfix will not run.
eu: Postfix-ek 2.6 kernelaren aurretikoak ez dituzten ezaugarri batzuek erabiltzen ditu. Instalazioarekin aurrera eginaz gero postfix ezingo da abiarazi.

source: Correct retry entry in master.cf for upgrade?
eu: Bertsio berritzerako master.cf-en retry sarrera zuzendu?

source: Postfix version 2.4 requires that the retry service be added to master.cf.
eu: Postfix 2.4 bertsioak retry zerbitzua master.cf-ra gehitzea eskatzen du.

source: Failure to fix this will result in a broken mailer. Decline this option to abort the upgrade, giving you the opportunity to add this configuration yourself. Accept this option to automatically make master.cf compatible with Postfix 2.4 in this respect.
eu: Hau konpontzean huts egiteak posta sistema apurtzea eragin dezake. Aukera hau alde batetara utzi bertsio berritzea utzi eta konfigurazio aldaketak eskuz egiteko aukera izateko. Aukera honen ezarpen automatikoa onartu gai honetan master.cf Postfix 2.4-arekin bateragarri egiteko.

source: Correct tlsmgr entry in master.cf for upgrade?
eu: Bertsio berritzerako master.cf-en tlsmgr sarrera zuzendu?

source: Postfix version 2.2 has changed the invocation of tlsmgr.
eu: Postfix 2.2 bertsioak tlsmgr deia egiteko modua aldatu du.

source: Failure to fix this will result in a broken mailer. Decline this option to abort the upgrade, giving you the opportunity to add this configuration yourself. Accept this option to automatically make master.cf compatible with Postfix 2.2 in this respect.
eu: Hau konpontzean huts egiteak posta sistema apurtzea eragin dezake. Aukera hau alde batetara utzi bertsio berritzea utzi eta konfigurazio aldaketak eskuz egiteko aukera izateko. Aukera honen ezarpen automatikoa onartu gai honetan master.cf Postfix 2.2-arekin bateragarri egiteko.

source: Ignore incorrect hostname entry?
eu: Ostalari izen baliogabea alde batetar utzi?

source: The string '${enteredstring}' does not follow RFC 1035 and does not appear to be a valid IP address.
eu: '${enteredstring}' kateak ez du 1035 RFC-a jarraitzen eta ez dirudi baliozko IP helbide bat denik.

source: RFC 1035 states that 'each component must start with an alphanum, end with an alphanum and contain only alphanums and hyphens. Components must be separated by full stops.'
eu: RFC 1035-ak hurrengoak ezartzen ditu: 'osagai bakoitza alfazenbakizko batez hasi eta amaitu eta alfazenbakizkoak eta marratxoak bakarrik eduki ditzake. osagaiak puntuez bereizirik egon behar dira.'

source: Please choose whether you want to keep that choice anyway.
eu: Mesedez bai sakatu aukera hau hala ere mantentzeko.

source: No configuration
eu: Konfiguraziorik ez

source: Internet Site
eu: Internet Gunea

source: Internet with smarthost
eu: Internet smarthost batez

source: Satellite system
eu: Satelite sistema

source: Local only
eu: Lokala bakarrik

source: General type of mail configuration:
eu: Posta konfigurazio mota orokorra:

source: Please select the mail server configuration type that best meets your needs.
eu: Mesedez hautatu zure beharrak hobe asetzen dituen posta zerbitzari konfigurazio mota.

source: No configuration: Should be chosen to leave the current configuration unchanged. Internet site: Mail is sent and received directly using SMTP. Internet with smarthost: Mail is received directly using SMTP or by running a utility such as fetchmail. Outgoing mail is sent using a smarthost. Satellite system: All mail is sent to another machine, called a 'smarthost', for delivery. Local only: The only delivered mail is the mail for local users. There is no network.
eu: Konfiguraziorik ez: Aukera hau hautatu dagoen konfigurazioa aldatu gabe uzteko. Internet gunea: Posta zuzenean SMTP bidez bidali eta jasoko da. Internet smarthost batez: Posta zuzenean SMTP bidez edo fetchmail antzerako lanabes batez jasoko da. Kanporako posta smarthost baten bidez bidaliko da. Satelite sistema: Posta guztia smarthost izeneko beste makina batetara bidaliko da hark banatu dezan. Lokala bakarrik: Erabiltzaile lokalen posta bakarrik banatuko da. Ez da sarerik behar.

source: Postfix not configured
eu: Postfix ez da konfiguratu

source: You have chosen 'No Configuration'. Postfix will not be configured and will not be started by default. Please run 'dpkg-reconfigure postfix' at a later date, or configure it yourself by: - Editing /etc/postfix/main.cf to your liking; - Running '/etc/init.d/postfix start'.
eu: 'Konfiguraziorik ez' aukeratu duzu. Postfix ez da konfiguratuko eta lehenespen bezala ez da sistema abiaraztean martxan ipiniko. Mesedez edo aurrerago 'dpkg-reconfigure postfix' abiarazi edo zure kabuz konfiguratu hau eginaz: - etc/postfix/main.cf editatu; - '/etc/init.d/postfix start' abiarazi.

source: System mail name:
eu: Sistema posta izena:

source: The "mail name" is the domain name used to "qualify" _ALL_ mail addresses without a domain name. This includes mail to and from <root>: please do not make your machine send out mail from root@example.org unless root@example.org has told you to.
eu: "posta izena" domeinu izenik gabeko posta GUZTIA "kualifikatzeko" erabiliko den domeinu izena da. Honek <root>-en bai barnerako bai kanporako posta guztirako ere erabiliko da. Mesedez ez egin zure makinak root@adibide.net posta kanpora bidaltzea root@adibide.net-ek egiteko esan ez badizu.

source: This name will also be used by other programs. It should be the single, fully qualified domain name (FQDN).
eu: Izen hau beste zenbait programek erabiliko dute. Guztiz kalifikaturiko domeinu izen (FQDN) bakan bat izan behar da.

source: Thus, if a mail address on the local host is foo@example.org, the correct value for this option would be example.org.
eu: Beraz, ostalari lokaleko posta helbide bat foo@adibide.org bada, aukera honen balio zuzena adibide.org izango litzateke.

source: Other destinations to accept mail for (blank for none):
eu: Bere posta onartuko den beste helburuak (zurian utzi batez erabiltzeko):

source: Please give a comma-separated list of domains for which this machine should consider itself the final destination. If this is a mail domain gateway, you probably want to include the top-level domain.
eu: Mesedez ezarri makina honek helburu bezala bere burua den domeinu zerrenda gakoz bereizirik. Hau posta domeinu atebide bat bada, ziurrenik maila goreneko domeinu izena gehitu nahiko duzu.

source: SMTP relay host (blank for none):
eu: SMTP birbidalketa ostalaria (zurin utzi batez erabiltzeko):

source: Please specify a domain, host, host:port, [address] or [address]:port. Use the form [destination] to turn off MX lookups. Leave this blank for no relay host.
eu: Mesedez ezarri domeinu, ostalari, ostalari:ataka, [helbidea] edo [helbidea]:ataka. [destination] erabili MX lookup-ak ezgaitzeko. Zurian utzi birbidalketarik nahi izan ez gero.

source: Do not specify more than one host.
eu: Ez ezarri ostalari bat baino gehiago.

source: The relayhost parameter specifies the default host to send mail to when no entry is matched in the optional transport(5) table. When no relay host is given, mail is routed directly to the destination.
eu: Birbidalketa-ostalari (relayhost) parametroak aukerako transport(5) taulan parekorik ez dagoen kasuetan posta bidaltzeko erabiliko den lehenetsiriko ostalaria ezartzen du, Birbidalkea ostalaririk ezartzen ez bada posta zuzenean helburura bidaliko da.

source: Use procmail for local delivery?
eu: Procmail erabili banaketa lokalerako?

source: Please choose whether you want to use procmail to deliver local mail.
eu: Mesedez hautatu posta lokala banatzeko procmail nola erabili nahi duzun.

source: Note that if you use procmail to deliver mail system-wide, you should set up an alias that forwards mail for root to a real user.
eu: Kontutan izan sisteman zehar posta banatzeko procmail erabiltzen baduzu, root posta erabiltzaile erreal bati bidaliko dion alias bat ezarri behar duzula.

source: all
eu: dena

source: Internet protocols to use:
eu: Erabiliko diren internet protokoloak:

source: By default, whichever Internet protocols are enabled on the system at installation time will be used. You may override this default with any of the following:
eu: Lehenespen bezala, sisteman instalazio garaian gaiturik dagoen edozein internet protokolo erabiliko da. Lehenespen hau aukera hauetako edozeinez gainidatzi dezakezu.

source: all : use both IPv4 and IPv6 addresses; ipv6: listen only on IPv6 addresses; ipv4: listen only on IPv4 addresses.
eu: dena: bai IPv4 bai IPv6 protokolo helbideak entzun; ipv6: ipv6 helbideak bakarrik entzun; ipv4: ipv4 helbideak bakarrik entzun.

source: Local address extension character:
eu: Helbide lokal hedapen karakterea:

source: Please choose the character that will be used to define a local address extension.
eu: Mesedez hautatu helbide lokal hedapena ezartzeko erabiliko den karakterea.

source: To not use address extensions, leave the string blank.
eu: Helbide hedapenik ez erabili nahi izanez gero, utzi katea zurian.

source: Bad recipient delimiter
eu: Hartzaile mugatzaile okerra

source: The recipient delimiter must be a single character. '${enteredstring}' is what you entered.
eu: Hartzaile mugatzailea karaktere soil bat izan behar da. '${enteredstring}' da idatzi duzuna.

source: Force synchronous updates on mail queue?
eu: Posta ilararen eguneraketa sinkronoa behartu?

source: If synchronous updates are forced, then mail is processed more slowly. If not forced, then there is a remote chance of losing some mail if the system crashes at an inopportune time, and you are not using a journaled filesystem (such as ext3).
eu: Eguneraketa sinkronoak behartuaz gero, posta mantsoago prozesatuko da. Behartzen ez bada, aukera txikiren bat dago posta batenbat galtzekoa sistema momentu desegoki batetan oker itzaltzen bada eta ez baduzu 'journaling' erabiltzen duen fitxategi sistema bat erabiltzen (ext3 bezala).

source: Local networks:
eu: Sare lokalak:

source: Please specify the network blocks for which this host should relay mail. The default is just the local host, which is needed by some mail user agents. The default includes local host for both IPv4 and IPv6. If just connecting via one IP version, the unused value(s) may be removed.
eu: Mesedez ezarri ostalari honek posta birbidali behar dien sare multzoak. Lehenespena ostalari lokala bakarrik da, zenbait posta agentek behar dute hau. Lehenespenez ostalari lokalean IPv4 eta IPv6 barneratzen ditu.IP bertsio bakar baten bidez konektatzen bazara erabitzen ez direnak kendu daitezke.

source: If this host is a smarthost for a block of machines, you need to specify the netblocks here, or mail will be rejected rather than relayed.
eu: Ostalari hau makina multzo baten smarthost-a bada, sare multzoak hemen ezarri behar dituzu, bestela posta birbidali beharrean ukatu egingo da.

source: To use the postfix default (which is based on the connected subnets), leave this blank.
eu: Postfix lehenespenak erabiltzeko (konektaturiko sareetan oinarriturikoa), utzi hau zurian.

source: Mailbox size limit (bytes):
eu: Postakutxa tamaina muga (byte):

source: Please specify the limit that Postfix should place on mailbox files to prevent runaway software errors. A value of zero (0) means no limit. The upstream default is 51200000.
eu: Mesedez ezarri postfix-ek postakutxetan kokatu behar duen muga software geldotasunak saihesteko. Zero (0) balioa muga ezgaitzeko. Jatorriaren muga 51200000 da.

source: Root and postmaster mail recipient:
eu: Root eta postmaster-en posta jasoko duena:

source: Mail for the 'postmaster', 'root', and other system accounts needs to be redirected to the user account of the actual system administrator.
eu: 'postmaster', 'root' eta beste sistema kontuetako posta sistema kudeatzailearen erabiltzaile kontura birbidali behar da.

source: If this value is left empty, such mail will be saved in /var/mail/nobody, which is not recommended.
eu: Balio hau hutsik badago, posta hau /var/mail/nobody-en gordeko da, hau egitea ez da gomendatzen.

source: Mail is not delivered to external delivery agents as root.
eu: Posta ez da root gisa kanpo bidalketa agenteerara banatuko.
